Revit 2016 API
DataExchangeMessageId Enumeration
 Predefined message ids for DataExchangeLog.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum DataExchangeMessageId
Visual Basic
Public Enumeration DataExchangeMessageId
Visual C++
public enum class DataExchangeMessageId
Members
Member name | Description
None |  No message.
UnitOfProgressCompleted |  That message will be sent at reasonable intervals to provide the using application an opportunity to update its progress indicator.
ObjectCreated |  An informational message. An object - a face, edge, solid, etc. - has been created successfully.
UnexpectedResult |  Unexpected result produced by a data conversion operation. Conversion may continue, but the results should be carefully reviewed.
InvalidSourceObject |  An error message. A source object was found to be invalid.
InvalidDataSet |  No data could be imported. Would typically be reported as a fatal error.
GenericError |  A catch-all error code. Used for errors that are not enumerated explicitly.
See Also
Autodesk.Revit.DB Namespace